---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexPrimitive.Dispose
source: html/cc553132-4ad1-94ca-9ecf-64bfa2d58f23.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexPrimitive.Dispose Method

Releases all resources used by the IndexPrimitive

## Syntax (C#)
```csharp
public void Dispose()
```